CRUD-general-purpose/2026/ranking_08-2026_couchbase-ce-802-vanilla-medium-medium-msazure_0_yBHz8vKT/0_run.txt
bin/ycsb run couchbase3 -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p couchbase.host=10.10.0.10,10.10.0.12,10.10.0.13 -p couchbase.bucket=benchantdb -p couchbase.password=Performance99 -p couchbase.username=benchant -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=5000001 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 
/usr/lib/jvm/java-1.8.0-openjdk-amd64/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/couchbase3-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/HdrHistogram-2.1.12.jar:/binary/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/binary/ycsb/couchbase3-binding/lib/rxjava-1.2.2.jar:/binary/ycsb/couchbase3-binding/lib/logback-classic-1.2.11.jar:/binary/ycsb/couchbase3-binding/lib/reactor-adapter-3.4.8.jar:/binary/ycsb/couchbase3-binding/lib/core-io-2.4.6.jar:/binary/ycsb/couchbase3-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/couchbase3-binding/lib/reactor-extra-3.4.8.jar:/binary/ycsb/couchbase3-binding/lib/java-client-3.4.6.jar:/binary/ycsb/couchbase3-binding/lib/couchbase3-binding-0.18.0-SNAPSHOT.jar:/binary/ycsb/couchbase3-binding/lib/logback-core-1.2.11.jar:/binary/ycsb/couchbase3-binding/lib/couchbase-transactions-1.2.4.jar:/binary/ycsb/couchbase3-binding/lib/reactive-streams-1.0.3.jar:/binary/ycsb/couchbase3-binding/lib/rxjava-reactive-streams-1.2.1.jar:/binary/ycsb/couchbase3-binding/lib/reactor-core-3.4.18.jar site.ycsb.Client -db site.ycsb.db.couchbase3.Couchbase3Client -s -p couchbase.host=10.10.0.10,10.10.0.12,10.10.0.13 -p couchbase.bucket=benchantdb -p couchbase.password=Performance99 -p couchbase.username=benchant -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=5000001 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -t
Command line: -db site.ycsb.db.couchbase3.Couchbase3Client -s -p couchbase.host=10.10.0.10,10.10.0.12,10.10.0.13 -p couchbase.bucket=benchantdb -p couchbase.password=Performance99 -p couchbase.username=benchant -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=5000001 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
insertstart, insertcount, recordcount: 5000001, -1, 5000000
CoreWorkload init --- orderedinserts: true
Starting test.
2026-08-12 15:15:04:334 0 sec: 0 operations; est completion in 0 second 
Maximum execution time specified as: 1800 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2026-08-12 15:15:14:337 10 sec: 335 operations; 33.49 current ops/sec; est completion in 18 days 15 hours [READ: Count=116, Max=1414143, Min=1114, Avg=184180.19, 50=12807, 90=632831, 99=1330175, 99.9=1414143, 99.99=1414143] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=219, Max=1690623, Min=675, Avg=373488.81, 50=10071, 90=1299455, 99=1689599, 99.9=1690623, 99.99=1690623] 
2026-08-12 15:15:24:343 20 sec: 1263 operations; 92.74 current ops/sec; est completion in 9 days 21 hours [READ: Count=474, Max=304639, Min=473, Avg=11247.12, 50=3709, 90=10111, 99=208639, 99.9=304639, 99.99=304639] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=454, Max=208639, Min=472, Avg=5282.19, 50=1186, 90=6383, 99=149119, 99.9=208639, 99.99=208639] 
2026-08-12 15:15:34:341 30 sec: 3761 operations; 249.85 current ops/sec; est completion in 4 days 23 hours [READ: Count=1261, Max=344831, Min=363, Avg=13326.14, 50=3601, 90=10623, 99=233215, 99.9=331263, 99.99=344831] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=1248, Max=334591, Min=387, Avg=3884.36, 50=921, 90=5959, 99=82303, 99.9=201727, 99.99=334591] 
2026-08-12 15:15:44:338 40 sec: 13660 operations; 990.2 current ops/sec; est completion in 1 day 19 hours [READ: Count=4967, Max=240895, Min=277, Avg=10302.88, 50=3567, 90=12335, 99=140287, 99.9=210815, 99.99=240895] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=4937, Max=240127, Min=308, Avg=4671.54, 50=819, 90=5999, 99=113663, 99.9=194175, 99.99=240127] 
2026-08-12 15:15:54:340 50 sec: 55778 operations; 4210.96 current ops/sec; est completion in 13 hours 26 minutes [READ: Count=21026, Max=169471, Min=244, Avg=4999.18, 50=3587, 90=9191, 99=38143, 99.9=76543, 99.99=167167] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=21141, Max=177407, Min=267, Avg=2394.48, 50=852, 90=5599, 99=15047, 99.9=59967, 99.99=95039] 
2026-08-12 15:16:04:336 60 sec: 244359 operations; 18865.65 current ops/sec; est completion in 3 hours 40 minutes [READ: Count=94633, Max=66047, Min=239, Avg=3033.06, 50=2513, 90=6163, 99=12103, 99.9=20319, 99.99=28431] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=93983, Max=37311, Min=263, Avg=2344.15, 50=1818, 90=4855, 99=9511, 99.9=18319, 99.99=27023] 
2026-08-12 15:16:14:334 70 sec: 1010119 operations; 76591.32 current ops/sec; est completion in 1 hour 1 minute [READ: Count=383291, Max=21663, Min=229, Avg=1149.71, 50=825, 90=2197, 99=4343, 99.9=18239, 99.99=20831] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=382578, Max=21631, Min=260, Avg=1177.51, 50=847, 90=2251, 99=4239, 99.9=17231, 99.99=20383] 
2026-08-12 15:16:24:334 80 sec: 1850873 operations; 84075.4 current ops/sec; est completion in 37 minutes [READ: Count=420117, Max=21087, Min=232, Avg=1172.99, 50=808, 90=2303, 99=3893, 99.9=15799, 99.99=19871] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=420565, Max=21039, Min=250, Avg=1168.28, 50=781, 90=2313, 99=3947, 99.9=15967, 99.99=19951] 
2026-08-12 15:16:34:334 90 sec: 2664289 operations; 81341.6 current ops/sec; est completion in 28 minutes [READ: Count=406752, Max=21791, Min=222, Avg=1223.42, 50=819, 90=2377, 99=4415, 99.9=18031, 99.99=21247] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=406658, Max=21887, Min=253, Avg=1214.55, 50=804, 90=2373, 99=4387, 99.9=18255, 99.99=21263] 
2026-08-12 15:16:44:334 100 sec: 3497535 operations; 83324.6 current ops/sec; est completion in 24 minutes [READ: Count=417194, Max=21743, Min=227, Avg=1192.49, 50=814, 90=2321, 99=4119, 99.9=16231, 99.99=20095] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=415987, Max=21743, Min=247, Avg=1191.74, 50=803, 90=2327, 99=4143, 99.9=16311, 99.99=20031] 
2026-08-12 15:16:54:334 110 sec: 4346237 operations; 84870.2 current ops/sec; est completion in 20 minutes [READ: Count=424703, Max=21743, Min=227, Avg=1174.31, 50=775, 90=2329, 99=4057, 99.9=15871, 99.99=21023] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=424113, Max=21855, Min=246, Avg=1169.05, 50=765, 90=2327, 99=4065, 99.9=15719, 99.99=20943] 
2026-08-12 15:17:04:334 120 sec: 5185087 operations; 83885 current ops/sec; est completion in 18 minutes [READ: Count=418815, Max=22415, Min=225, Avg=1185.5, 50=797, 90=2343, 99=3879, 99.9=18031, 99.99=20975] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=419974, Max=22415, Min=242, Avg=1188.07, 50=796, 90=2357, 99=3913, 99.9=17871, 99.99=20767] 
2026-08-12 15:17:14:334 130 sec: 6027683 operations; 84259.6 current ops/sec; est completion in 17 minutes [READ: Count=422193, Max=27071, Min=221, Avg=1166.84, 50=785, 90=2293, 99=3929, 99.9=17007, 99.99=23935] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=420377, Max=27071, Min=247, Avg=1197.67, 50=819, 90=2333, 99=3981, 99.9=16815, 99.99=24847] 
2026-08-12 15:17:24:334 140 sec: 6864140 operations; 83645.7 current ops/sec; est completion in 16 minutes [READ: Count=419119, Max=22447, Min=216, Avg=1179.4, 50=814, 90=2321, 99=4235, 99.9=15799, 99.99=21151] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=417356, Max=22479, Min=247, Avg=1203.12, 50=837, 90=2355, 99=4283, 99.9=15823, 99.99=20767] 
2026-08-12 15:17:34:334 150 sec: 7705237 operations; 84109.7 current ops/sec; est completion in 15 minutes [READ: Count=420707, Max=22687, Min=220, Avg=1171.97, 50=787, 90=2307, 99=4195, 99.9=17599, 99.99=21135] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=420386, Max=22495, Min=243, Avg=1197.85, 50=815, 90=2349, 99=4211, 99.9=17663, 99.99=21039] 
2026-08-12 15:17:44:334 160 sec: 8545226 operations; 83998.9 current ops/sec; est completion in 14 minutes [READ: Count=419973, Max=27951, Min=223, Avg=1177.88, 50=801, 90=2269, 99=4267, 99.9=16767, 99.99=24447] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=420009, Max=28047, Min=250, Avg=1195.5, 50=814, 90=2289, 99=4347, 99.9=17503, 99.99=23839] 
2026-08-12 15:17:54:334 170 sec: 9388940 operations; 84371.4 current ops/sec; est completion in 13 minutes [READ: Count=422091, Max=24431, Min=219, Avg=1174.53, 50=847, 90=2209, 99=4419, 99.9=15127, 99.99=22319] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=421579, Max=24447, Min=245, Avg=1188.78, 50=860, 90=2235, 99=4467, 99.9=15023, 99.99=22447] 
2026-08-12 15:18:04:334 180 sec: 10200984 operations; 81204.4 current ops/sec; est completion in 12 minutes [READ: Count=406324, Max=22543, Min=231, Avg=1222.31, 50=788, 90=2435, 99=4291, 99.9=18943, 99.99=21583] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=405771, Max=22639, Min=252, Avg=1233.52, 50=798, 90=2457, 99=4295, 99.9=19183, 99.99=21647] 
2026-08-12 15:18:14:334 190 sec: 11002126 operations; 80114.2 current ops/sec; est completion in 12 minutes [READ: Count=400951, Max=22655, Min=229, Avg=1237.52, 50=791, 90=2463, 99=4583, 99.9=18383, 99.99=21519] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=400183, Max=22623, Min=247, Avg=1252.22, 50=805, 90=2493, 99=4579, 99.9=18527, 99.99=21503] 
2026-08-12 15:18:24:334 200 sec: 11803517 operations; 80139.1 current ops/sec; est completion in 11 minutes [READ: Count=400305, Max=25759, Min=223, Avg=1235.33, 50=817, 90=2421, 99=4747, 99.9=19007, 99.99=21471] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=401078, Max=25759, Min=249, Avg=1253.67, 50=834, 90=2443, 99=4739, 99.9=19039, 99.99=21503] 
2026-08-12 15:18:34:334 210 sec: 12613296 operations; 80977.9 current ops/sec; est completion in 11 minutes [READ: Count=404255, Max=22703, Min=218, Avg=1224.24, 50=819, 90=2385, 99=4763, 99.9=17663, 99.99=20927] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=405527, Max=22687, Min=249, Avg=1239.28, 50=831, 90=2411, 99=4759, 99.9=17935, 99.99=20975] 
2026-08-12 15:18:44:334 220 sec: 13425685 operations; 81238.9 current ops/sec; est completion in 11 minutes [READ: Count=406194, Max=22191, Min=220, Avg=1223.89, 50=778, 90=2479, 99=4367, 99.9=16911, 99.99=21231] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=406214, Max=22175, Min=252, Avg=1231.82, 50=781, 90=2499, 99=4395, 99.9=16879, 99.99=21199] 
2026-08-12 15:18:54:334 230 sec: 14219644 operations; 79395.9 current ops/sec; est completion in 10 minutes [READ: Count=396587, Max=22447, Min=224, Avg=1252.48, 50=802, 90=2447, 99=5127, 99.9=18927, 99.99=21519] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=397350, Max=22399, Min=243, Avg=1260.49, 50=808, 90=2463, 99=5127, 99.9=18655, 99.99=21679] 
2026-08-12 15:19:04:334 240 sec: 15030215 operations; 81057.1 current ops/sec; est completion in 10 minutes [READ: Count=404354, Max=26127, Min=212, Avg=1223.82, 50=854, 90=2331, 99=4771, 99.9=16831, 99.99=21983] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=406208, Max=26207, Min=253, Avg=1237.5, 50=867, 90=2345, 99=4779, 99.9=17135, 99.99=23215] 
2026-08-12 15:19:14:334 250 sec: 15800359 operations; 77014.4 current ops/sec; est completion in 10 minutes [READ: Count=385323, Max=23103, Min=213, Avg=1287.46, 50=861, 90=2577, 99=5303, 99.9=16527, 99.99=21055] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=384837, Max=23231, Min=244, Avg=1303.65, 50=877, 90=2599, 99=5331, 99.9=16495, 99.99=21199] 
2026-08-12 15:19:24:334 260 sec: 16590377 operations; 79001.8 current ops/sec; est completion in 9 minutes [READ: Count=395144, Max=24655, Min=218, Avg=1255.68, 50=847, 90=2469, 99=5003, 99.9=16991, 99.99=20335] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=394828, Max=24735, Min=253, Avg=1270.37, 50=858, 90=2495, 99=5027, 99.9=16959, 99.99=20255] 
2026-08-12 15:19:34:334 270 sec: 17402972 operations; 81259.5 current ops/sec; est completion in 9 minutes [READ: Count=406456, Max=22527, Min=224, Avg=1218.12, 50=827, 90=2421, 99=4331, 99.9=16991, 99.99=21711] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=406188, Max=22543, Min=249, Avg=1237.56, 50=842, 90=2449, 99=4359, 99.9=17215, 99.99=21663] 
2026-08-12 15:19:44:334 280 sec: 18205292 operations; 80232 current ops/sec; est completion in 9 minutes [READ: Count=401387, Max=21919, Min=219, Avg=1232.4, 50=832, 90=2433, 99=4535, 99.9=18095, 99.99=21183] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=400898, Max=24703, Min=239, Avg=1254.96, 50=853, 90=2469, 99=4527, 99.9=17903, 99.99=21087] 
2026-08-12 15:19:54:334 290 sec: 19027123 operations; 82183.1 current ops/sec; est completion in 8 minutes [READ: Count=410957, Max=21983, Min=222, Avg=1202.27, 50=834, 90=2333, 99=4455, 99.9=17263, 99.99=20943] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=410808, Max=21967, Min=245, Avg=1223.35, 50=853, 90=2369, 99=4491, 99.9=17391, 99.99=20863] 
2026-08-12 15:20:04:334 300 sec: 19820473 operations; 79335 current ops/sec; est completion in 8 minutes [READ: Count=396552, Max=34495, Min=225, Avg=1244.12, 50=843, 90=2465, 99=4699, 99.9=18511, 99.99=24415] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=396862, Max=34495, Min=249, Avg=1274.08, 50=871, 90=2509, 99=4739, 99.9=18655, 99.99=26927] 
2026-08-12 15:20:14:334 310 sec: 20636616 operations; 81614.3 current ops/sec; est completion in 8 minutes [READ: Count=407963, Max=21887, Min=216, Avg=1208.89, 50=844, 90=2351, 99=5031, 99.9=15831, 99.99=20671] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=408211, Max=21791, Min=238, Avg=1236.29, 50=868, 90=2397, 99=5087, 99.9=15711, 99.99=20495] 
2026-08-12 15:20:24:334 320 sec: 21428121 operations; 79150.5 current ops/sec; est completion in 8 minutes [READ: Count=394975, Max=22095, Min=214, Avg=1250.81, 50=883, 90=2351, 99=5443, 99.9=17135, 99.99=21567] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=396562, Max=22367, Min=242, Avg=1270.73, 50=903, 90=2379, 99=5523, 99.9=16879, 99.99=21551] 
2026-08-12 15:20:34:334 330 sec: 22211447 operations; 78332.6 current ops/sec; est completion in 7 minutes [READ: Count=391954, Max=26655, Min=206, Avg=1260.49, 50=877, 90=2403, 99=5271, 99.9=19199, 99.99=24463] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=391367, Max=26511, Min=244, Avg=1287.5, 50=901, 90=2445, 99=5343, 99.9=19023, 99.99=23903] 
2026-08-12 15:20:44:334 340 sec: 22994266 operations; 78281.9 current ops/sec; est completion in 7 minutes [READ: Count=391098, Max=23375, Min=219, Avg=1262.88, 50=845, 90=2505, 99=5431, 99.9=18095, 99.99=22319] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=391765, Max=23439, Min=235, Avg=1286.71, 50=865, 90=2545, 99=5447, 99.9=17999, 99.99=22207] 
2026-08-12 15:20:54:334 350 sec: 23795973 operations; 80170.7 current ops/sec; est completion in 7 minutes [READ: Count=401650, Max=21951, Min=208, Avg=1235.01, 50=872, 90=2433, 99=5023, 99.9=15359, 99.99=20719] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=399977, Max=21887, Min=250, Avg=1254.6, 50=889, 90=2455, 99=5099, 99.9=15623, 99.99=21311] 
2026-08-12 15:21:04:334 360 sec: 24580468 operations; 78449.5 current ops/sec; est completion in 7 minutes [READ: Count=392047, Max=38815, Min=225, Avg=1261.88, 50=882, 90=2437, 99=5199, 99.9=18607, 99.99=22943] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=392489, Max=23823, Min=249, Avg=1282.34, 50=902, 90=2467, 99=5259, 99.9=18367, 99.99=22383] 
2026-08-12 15:21:14:334 370 sec: 25348504 operations; 76803.6 current ops/sec; est completion in 6 minutes [READ: Count=383844, Max=54655, Min=220, Avg=1291.16, 50=886, 90=2573, 99=5527, 99.9=18591, 99.99=22863] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=384222, Max=25071, Min=244, Avg=1307.85, 50=903, 90=2591, 99=5511, 99.9=18431, 99.99=22015] 
2026-08-12 15:21:24:334 380 sec: 26105352 operations; 75684.8 current ops/sec; est completion in 6 minutes [READ: Count=378883, Max=412159, Min=218, Avg=1329.24, 50=902, 90=2413, 99=5535, 99.9=19391, 99.99=351487] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=377904, Max=351999, Min=250, Avg=1308.14, 50=915, 90=2419, 99=5415, 99.9=18911, 99.99=23359] 
2026-08-12 15:21:34:334 390 sec: 26899468 operations; 79411.6 current ops/sec; est completion in 6 minutes [READ: Count=397702, Max=31839, Min=201, Avg=1255.67, 50=917, 90=2359, 99=5083, 99.9=17903, 99.99=21839] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=396398, Max=22335, Min=252, Avg=1258.02, 50=925, 90=2369, 99=4927, 99.9=17535, 99.99=21599] 
2026-08-12 15:21:44:334 400 sec: 27690057 operations; 79058.9 current ops/sec; est completion in 6 minutes [READ: Count=394903, Max=31711, Min=224, Avg=1261.09, 50=901, 90=2329, 99=5315, 99.9=18815, 99.99=21983] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=395710, Max=22607, Min=248, Avg=1263.6, 50=913, 90=2327, 99=5171, 99.9=18687, 99.99=21663] 
2026-08-12 15:21:54:334 410 sec: 28452721 operations; 76266.4 current ops/sec; est completion in 6 minutes [READ: Count=380988, Max=377343, Min=213, Avg=1328.19, 50=910, 90=2331, 99=5387, 99.9=20879, 99.99=318463] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=381641, Max=318975, Min=244, Avg=1289.31, 50=917, 90=2307, 99=5171, 99.9=19871, 99.99=26239] 
2026-08-12 15:22:04:334 420 sec: 29225360 operations; 77263.9 current ops/sec; est completion in 5 minutes [READ: Count=386835, Max=43807, Min=217, Avg=1309.26, 50=916, 90=2517, 99=5779, 99.9=18207, 99.99=24223] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=385847, Max=21759, Min=240, Avg=1274.29, 50=910, 90=2455, 99=5279, 99.9=15791, 99.99=20671] 
2026-08-12 15:22:14:334 430 sec: 29969392 operations; 74403.2 current ops/sec; est completion in 5 minutes [READ: Count=371523, Max=66303, Min=221, Avg=1355.74, 50=931, 90=2629, 99=5955, 99.9=19487, 99.99=24495] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=372494, Max=24799, Min=249, Avg=1327.44, 50=926, 90=2567, 99=5555, 99.9=18527, 99.99=22271] 
2026-08-12 15:22:24:334 440 sec: 30684959 operations; 71556.7 current ops/sec; est completion in 5 minutes [READ: Count=357555, Max=369151, Min=222, Avg=1461.77, 50=919, 90=2479, 99=6711, 99.9=23983, 99.99=309503] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=358005, Max=305919, Min=255, Avg=1328.32, 50=907, 90=2369, 99=5539, 99.9=19871, 99.99=192255] 
2026-08-12 15:22:34:334 450 sec: 31474703 operations; 78974.4 current ops/sec; est completion in 5 minutes [READ: Count=394866, Max=39967, Min=215, Avg=1288.82, 50=906, 90=2371, 99=5903, 99.9=19711, 99.99=27391] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=394881, Max=26559, Min=244, Avg=1238.75, 50=897, 90=2287, 99=5151, 99.9=18911, 99.99=21359] 
2026-08-12 15:22:44:334 460 sec: 32241169 operations; 76646.6 current ops/sec; est completion in 5 minutes [READ: Count=383085, Max=49823, Min=230, Avg=1344.37, 50=946, 90=2521, 99=6007, 99.9=18799, 99.99=30287] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=383410, Max=24303, Min=243, Avg=1260.05, 50=921, 90=2361, 99=4971, 99.9=16447, 99.99=21807] 
2026-08-12 15:22:54:334 470 sec: 32942348 operations; 70117.9 current ops/sec; est completion in 5 minutes [READ: Count=350677, Max=364287, Min=215, Avg=1504.37, 50=926, 90=2659, 99=6271, 99.9=33791, 99.99=318463] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=350478, Max=318207, Min=251, Avg=1343.07, 50=890, 90=2499, 99=5171, 99.9=19839, 99.99=315135] 
2026-08-12 15:23:04:334 480 sec: 33683311 operations; 74096.3 current ops/sec; est completion in 4 minutes [READ: Count=370035, Max=56479, Min=216, Avg=1390.97, 50=907, 90=2759, 99=6675, 99.9=19999, 99.99=31903] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=370925, Max=23167, Min=239, Avg=1303.59, 50=874, 90=2619, 99=5439, 99.9=18511, 99.99=21599] 
2026-08-12 15:23:14:334 490 sec: 34421415 operations; 73810.4 current ops/sec; est completion in 4 minutes [READ: Count=368977, Max=69311, Min=209, Avg=1401.6, 50=952, 90=2737, 99=6587, 99.9=19855, 99.99=29759] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=369095, Max=22847, Min=253, Avg=1303.19, 50=920, 90=2523, 99=5459, 99.9=18111, 99.99=21727] 
2026-08-12 15:23:24:334 500 sec: 35128630 operations; 70721.5 current ops/sec; est completion in 4 minutes [READ: Count=354031, Max=396287, Min=218, Avg=1489.02, 50=931, 90=2631, 99=6751, 99.9=21855, 99.99=347391] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=353229, Max=345599, Min=238, Avg=1330.94, 50=895, 90=2427, 99=5551, 99.9=19871, 99.99=222975] 
2026-08-12 15:23:34:334 510 sec: 35853531 operations; 72490.1 current ops/sec; est completion in 4 minutes [READ: Count=362031, Max=187775, Min=215, Avg=1458.4, 50=962, 90=2697, 99=8023, 99.9=22719, 99.99=82687] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=362798, Max=83391, Min=240, Avg=1298.99, 50=909, 90=2433, 99=5619, 99.9=19295, 99.99=37951] 
2026-08-12 15:23:44:334 520 sec: 36594983 operations; 74145.2 current ops/sec; est completion in 4 minutes [READ: Count=370346, Max=55487, Min=225, Avg=1410.19, 50=974, 90=2625, 99=7115, 99.9=20255, 99.99=32399] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=371154, Max=23263, Min=248, Avg=1282.77, 50=924, 90=2381, 99=5631, 99.9=18655, 99.99=21327] 
2026-08-12 15:23:54:334 530 sec: 37319284 operations; 72430.1 current ops/sec; est completion in 3 minutes [READ: Count=362303, Max=325887, Min=219, Avg=1460.47, 50=966, 90=2705, 99=7051, 99.9=19311, 99.99=279551] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=361996, Max=280319, Min=246, Avg=1296.26, 50=907, 90=2463, 99=5287, 99.9=15071, 99.99=272639] 
2026-08-12 15:24:04:334 540 sec: 38004999 operations; 68571.5 current ops/sec; est completion in 3 minutes [READ: Count=343023, Max=392959, Min=219, Avg=1570.49, 50=953, 90=2825, 99=10175, 99.9=27503, 99.99=365823] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=342717, Max=365823, Min=251, Avg=1341.14, 50=885, 90=2553, 99=5635, 99.9=18015, 99.99=361471] 
2026-08-12 15:24:14:334 550 sec: 38738066 operations; 73306.7 current ops/sec; est completion in 3 minutes [READ: Count=366700, Max=36831, Min=225, Avg=1429.46, 50=1008, 90=2707, 99=6671, 99.9=21167, 99.99=30223] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=366260, Max=22975, Min=247, Avg=1291.61, 50=954, 90=2447, 99=5203, 99.9=14863, 99.99=21999] 
2026-08-12 15:24:24:334 560 sec: 39430704 operations; 69263.8 current ops/sec; est completion in 3 minutes [READ: Count=346494, Max=337919, Min=229, Avg=1554.84, 50=982, 90=2777, 99=10375, 99.9=23567, 99.99=293119] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=346144, Max=293375, Min=246, Avg=1328.59, 50=918, 90=2447, 99=5551, 99.9=19679, 99.99=287999] 
2026-08-12 15:24:34:334 570 sec: 40135973 operations; 70526.9 current ops/sec; est completion in 3 minutes [READ: Count=353419, Max=319487, Min=231, Avg=1553.12, 50=963, 90=2567, 99=9991, 99.9=28255, 99.99=284159] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=351945, Max=276991, Min=234, Avg=1279.19, 50=900, 90=2265, 99=5155, 99.9=19199, 99.99=263423] 
2026-08-12 15:24:44:334 580 sec: 40859332 operations; 72335.9 current ops/sec; est completion in 3 minutes [READ: Count=361386, Max=34879, Min=219, Avg=1453.21, 50=995, 90=2777, 99=7275, 99.9=20463, 99.99=27855] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=361962, Max=23247, Min=248, Avg=1307.21, 50=924, 90=2505, 99=5627, 99.9=18639, 99.99=22031] 
2026-08-12 15:24:54:334 590 sec: 41622456 operations; 76312.4 current ops/sec; est completion in 2 minutes [READ: Count=381768, Max=96959, Min=225, Avg=1368.23, 50=949, 90=2659, 99=6107, 99.9=19439, 99.99=31967] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=381371, Max=32271, Min=252, Avg=1247.81, 50=885, 90=2371, 99=5227, 99.9=18863, 99.99=27391] 
2026-08-12 15:25:04:334 600 sec: 42263138 operations; 64068.2 current ops/sec; est completion in 2 minutes [READ: Count=320341, Max=326399, Min=211, Avg=1706.56, 50=985, 90=3045, 99=7895, 99.9=41855, 99.99=282623] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=320293, Max=267263, Min=237, Avg=1410.51, 50=855, 90=2657, 99=5583, 99.9=20239, 99.99=261503] 
2026-08-12 15:25:14:334 610 sec: 42958903 operations; 69576.5 current ops/sec; est completion in 2 minutes [READ: Count=347586, Max=69631, Min=221, Avg=1528.94, 50=1021, 90=2953, 99=8035, 99.9=20863, 99.99=41791] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=348189, Max=27631, Min=245, Avg=1341.48, 50=909, 90=2603, 99=6007, 99.9=18719, 99.99=23599] 
2026-08-12 15:25:24:334 620 sec: 43673611 operations; 71470.8 current ops/sec; est completion in 2 minutes [READ: Count=357206, Max=56255, Min=213, Avg=1475.59, 50=1000, 90=2949, 99=6343, 99.9=18911, 99.99=31855] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=357489, Max=24191, Min=246, Avg=1318.22, 50=883, 90=2651, 99=5227, 99.9=17423, 99.99=21663] 
2026-08-12 15:25:34:334 630 sec: 44344178 operations; 67056.7 current ops/sec; est completion in 2 minutes [READ: Count=335547, Max=321535, Min=209, Avg=1636.06, 50=1007, 90=2855, 99=6963, 99.9=28815, 99.99=295935] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=335084, Max=292351, Min=237, Avg=1341.59, 50=903, 90=2445, 99=5119, 99.9=17743, 99.99=263167] 
2026-08-12 15:25:44:334 640 sec: 45036511 operations; 69233.3 current ops/sec; est completion in 2 minutes [READ: Count=345822, Max=158847, Min=215, Avg=1541.74, 50=1014, 90=3121, 99=7115, 99.9=19983, 99.99=107263] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=346515, Max=106751, Min=248, Avg=1342.7, 50=897, 90=2681, 99=5699, 99.9=18847, 99.99=103679] 
2026-08-12 15:25:54:334 650 sec: 45774180 operations; 73766.9 current ops/sec; est completion in 1 minute [READ: Count=368934, Max=76351, Min=219, Avg=1437.25, 50=985, 90=2839, 99=6615, 99.9=17871, 99.99=30575] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=368619, Max=22975, Min=253, Avg=1267.28, 50=889, 90=2477, 99=5219, 99.9=16447, 99.99=20383] 
2026-08-12 15:26:04:334 660 sec: 46405013 operations; 63083.3 current ops/sec; est completion in 1 minute [READ: Count=315225, Max=360959, Min=229, Avg=1787.92, 50=1009, 90=2959, 99=14135, 99.9=34975, 99.99=349183] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=315729, Max=347647, Min=245, Avg=1380.64, 50=905, 90=2379, 99=6139, 99.9=20847, 99.99=341247] 
2026-08-12 15:26:14:334 670 sec: 47095792 operations; 69077.9 current ops/sec; est completion in 1 minute [READ: Count=345701, Max=43647, Min=220, Avg=1612.42, 50=997, 90=2947, 99=13407, 99.9=27519, 99.99=36703] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=345048, Max=39615, Min=247, Avg=1278.06, 50=880, 90=2301, 99=6167, 99.9=21855, 99.99=35935] 
2026-08-12 15:26:24:334 680 sec: 47780083 operations; 68429.1 current ops/sec; est completion in 1 minute [READ: Count=342226, Max=108159, Min=216, Avg=1624.25, 50=1014, 90=3025, 99=12375, 99.9=28367, 99.99=60927] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=342098, Max=60927, Min=250, Avg=1293.7, 50=893, 90=2383, 99=6159, 99.9=21087, 99.99=51327] 
2026-08-12 15:26:34:334 690 sec: 48411850 operations; 63176.7 current ops/sec; est completion in 1 minute [READ: Count=316146, Max=402687, Min=212, Avg=1760.46, 50=1026, 90=3105, 99=10679, 99.9=44511, 99.99=380671] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=315554, Max=378367, Min=246, Avg=1400.37, 50=900, 90=2563, 99=5927, 99.9=24159, 99.99=372479] 
2026-08-12 15:26:44:334 700 sec: 49077991 operations; 66614.1 current ops/sec; est completion in 1 minute [READ: Count=333049, Max=56383, Min=207, Avg=1630.8, 50=1059, 90=3235, 99=8719, 99.9=24031, 99.99=46271] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=333113, Max=49023, Min=245, Avg=1367.19, 50=908, 90=2695, 99=5867, 99.9=21615, 99.99=32335] 
2026-08-12 15:26:54:334 710 sec: 49751568 operations; 67357.7 current ops/sec; est completion in 1 minute [READ: Count=336967, Max=39583, Min=211, Avg=1597.24, 50=1039, 90=3307, 99=7503, 99.9=21647, 99.99=30015] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=336626, Max=25215, Min=240, Avg=1367.31, 50=868, 90=2829, 99=5919, 99.9=19503, 99.99=23791] 
2026-08-12 15:27:04:334 720 sec: 50342225 operations; 59065.7 current ops/sec; est completion in 53 seconds [READ: Count=295653, Max=356863, Min=230, Avg=1889.95, 50=1075, 90=3361, 99=10127, 99.9=38911, 99.99=338943] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=294986, Max=337663, Min=252, Avg=1491.04, 50=887, 90=2801, 99=6231, 99.9=23231, 99.99=270847] 
2026-08-12 15:27:14:334 730 sec: 50990528 operations; 64830.3 current ops/sec; est completion in 44 seconds [READ: Count=323450, Max=166783, Min=219, Avg=1719.42, 50=1024, 90=3229, 99=14063, 99.9=27519, 99.99=131199] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=324777, Max=131199, Min=251, Avg=1359.34, 50=851, 90=2657, 99=5875, 99.9=21039, 99.99=103039] 
2026-08-12 15:27:24:334 740 sec: 51665516 operations; 67498.8 current ops/sec; est completion in 34 seconds [READ: Count=337498, Max=136447, Min=224, Avg=1661.18, 50=1017, 90=3125, 99=12855, 99.9=27055, 99.99=98175] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=337565, Max=98239, Min=248, Avg=1299.76, 50=874, 90=2433, 99=6267, 99.9=20799, 99.99=24623] 
2026-08-12 15:27:34:334 750 sec: 52255947 operations; 59043.1 current ops/sec; est completion in 26 seconds [READ: Count=295382, Max=391423, Min=228, Avg=1938.9, 50=1055, 90=3227, 99=14415, 99.9=34303, 99.99=383743] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=294974, Max=379903, Min=250, Avg=1440.66, 50=904, 90=2377, 99=6875, 99.9=21903, 99.99=377599] 
2026-08-12 15:27:44:334 760 sec: 52906686 operations; 65073.9 current ops/sec; est completion in 16 seconds [READ: Count=325036, Max=63839, Min=216, Avg=1705.28, 50=1081, 90=3339, 99=11847, 99.9=24863, 99.99=41855] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=325794, Max=33503, Min=253, Avg=1366.54, 50=908, 90=2619, 99=6615, 99.9=21743, 99.99=29247] 
2026-08-12 15:27:54:334 770 sec: 53539283 operations; 63259.7 current ops/sec; est completion in 7 second [READ: Count=316739, Max=97407, Min=227, Avg=1756.97, 50=1093, 90=3439, 99=12239, 99.9=25711, 99.99=61055] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT: Count=315874, Max=55423, Min=254, Avg=1399.62, 50=914, 90=2693, 99=7355, 99.9=22431, 99.99=51423] 
Could not wait until max specified time, TerminatorThread interrupted.
2026-08-12 15:28:03:022 778 sec: 54000000 operations; 53029.12 current ops/sec; [READ: Count=230754, Max=313599, Min=218, Avg=1761.6, 50=1040, 90=3195, 99=10591, 99.9=28031, 99.99=302591] [NEXT-KEYGEN: Count=0, Max=0, Min=0, Avg=0, 50=0, 90=0, 99=0, 99.9=0, 99.99=0] [CLEANUP: Count=100, Max=16, Min=1, Avg=2.89, 50=2, 90=4, 99=14, 99.9=16, 99.99=16] [INSERT: Count=229856, Max=297215, Min=255, Avg=1350.51, 50=872, 90=2523, 99=6507, 99.9=20191, 99.99=294655] 
[OVERALL], RunTime(ms), 778688
[OVERALL], Throughput(ops/sec), 69347.41513931126
[TOTAL_GCS_PS_Scavenge], Count, 2752
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 6438
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.8267752938275663
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 21
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0026968439220843264
[TOTAL_GCs], Count, 2753
[TOTAL_GC_TIME], Time(ms), 6459
[TOTAL_GC_TIME_%], Time(%), 0.8294721377496508
[READ], Operations, 27002544
[READ], AverageLatency(us), 1389.083618269449
[READ], MinLatency(us), 201
[READ], MaxLatency(us), 1414143
[READ], 50thPercentileLatency(us), 910
[READ], 90thPercentileLatency(us), 2589
[READ], 95thPercentileLatency(us), 3359
[READ], 99thPercentileLatency(us), 6463
[READ], 99.99PercentileLatency(us), 97407
[READ], 99.99999PercentileLatency(us), 1129471
[READ], Return=OK, 27002544
[NEXT-KEYGEN], Operations, 0
[NEXT-KEYGEN], AverageLatency(us), 0.0
[NEXT-KEYGEN], MinLatency(us), 0
[NEXT-KEYGEN], MaxLatency(us), 0
[NEXT-KEYGEN], 50thPercentileLatency(us), 0
[NEXT-KEYGEN], 90thPercentileLatency(us), 0
[NEXT-KEYGEN], 95thPercentileLatency(us), 0
[NEXT-KEYGEN], 99thPercentileLatency(us), 0
[NEXT-KEYGEN], 99.99PercentileLatency(us), 0
[NEXT-KEYGEN], 99.99999PercentileLatency(us), 0
[NEXT-KEYGEN], Return=Loop, 1002712161
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 2.89
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 16
[CLEANUP], 50thPercentileLatency(us), 2
[CLEANUP], 90thPercentileLatency(us), 4
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 14
[CLEANUP], 99.99PercentileLatency(us), 16
[CLEANUP], 99.99999PercentileLatency(us), 16
[INSERT], Operations, 26997456
[INSERT], AverageLatency(us), 1288.9695502050267
[INSERT], MinLatency(us), 234
[INSERT], MaxLatency(us), 1690623
[INSERT], 50thPercentileLatency(us), 877
[INSERT], 90thPercentileLatency(us), 2455
[INSERT], 95thPercentileLatency(us), 3073
[INSERT], 99thPercentileLatency(us), 5287
[INSERT], 99.99PercentileLatency(us), 27823
[INSERT], 99.99999PercentileLatency(us), 1689599
[INSERT], Return=OK, 26997456